# n개의 최소공배수
'''
두 수의 최소공배수(Least Common Multiple)란 입력된 두 수의 배수 중 공통이 되는 가장 작은 숫자를 의미합니다.
예를 들어 2와 7의 최소공배수는 14가 됩니다. 정의를 확장해서, n개의 수의 최소공배수는 n 개의 수들의 배수 중 공통이 되는 가장 작은 숫자가 됩니다.
n개의 숫자를 담은 배열 arr이 입력되었을 때 이 수들의 최소공배수를 반환하는 함수, solution을 완성해 주세요.

제한 사항
arr은 길이 1이상, 15이하인 배열입니다.
arr의 원소는 100 이하인 자연수입니다.

입출력 예
arr	result
[2,6,8,14]	168
[1,2,3]	6
'''


'''
앞에 2개의 최소공배수를 구한다

그 최소공배수와 다음 값의 최소공배수를 구한다 (a와 b의 최소공배수 = (a*b)/a,b의 최대공약수

반복한다.
'''




from math import gcd
arr = [2,6,8,14]

answer = arr[0]
for i in range(1, len(arr)):
    answer = (answer*arr[i]) // gcd(answer, arr[i])


