/*
오래전 유행했던 콜라 문제가 있습니다. 콜라 문제의 지문은 다음과 같습니다.

정답은 아무에게도 말하지 마세요.

콜라 빈 병 2개를 가져다주면 콜라 1병을 주는 마트가 있다. 빈 병 20개를 가져다주면 몇 병을 받을 수 있는가?

단, 보유 중인 빈 병이 2개 미만이면, 콜라를 받을 수 없다.

문제를 풀던 상빈이는 콜라 문제의 완벽한 해답을 찾았습니다. 상빈이가 푼 방법은 아래 그림과 같습니다. 우선 콜라 빈 병 20병을 가져가서 10병을 받습니다. 받은 10병을 모두 마신 뒤, 가져가서 5병을 받습니다. 5병 중 4병을 모두 마신 뒤 가져가서 2병을 받고, 또 2병을 모두 마신 뒤 가져가서 1병을 받습니다. 받은 1병과 5병을 받았을 때 남은 1병을 모두 마신 뒤 가져가면 1병을 또 받을 수 있습니다. 이 경우 상빈이는 총 10 + 5 + 2 + 1 + 1 = 19병의 콜라를 받을 수 있습니다.

문제를 열심히 풀던 상빈이는 일반화된 콜라 문제를 생각했습니다. 이 문제는 빈 병 a개를 가져다주면 콜라 b병을 주는 마트가 있을 때, 빈 병 n개를 가져다주면 몇 병을 받을 수 있는지 계산하는 문제입니다. 기존 콜라 문제와 마찬가지로, 보유 중인 빈 병이 a개 미만이면, 추가적으로 빈 병을 받을 순 없습니다. 상빈이는 열심히 고심했지만, 일반화된 콜라 문제의 답을 찾을 수 없었습니다. 상빈이를 도와, 일반화된 콜라 문제를 해결하는 프로그램을 만들어 주세요.

콜라를 받기 위해 마트에 주어야 하는 병 수 a, 빈 병 a개를 가져다 주면 마트가 주는 콜라 병 수 b, 상빈이가 가지고 있는 빈 병의 개수 n이 매개변수로 주어집니다. 상빈이가 받을 수 있는 콜라의 병 수를 return 하도록 solution 함수를 작성해주세요.

입출력 예 #1

본문에서 설명한 예시입니다.
입출력 예 #2

빈 병 20개 중 18개를 마트에 가져가서, 6병의 콜라를 받습니다. 이때 상빈이가 가지고 있는 콜라 병의 수는 8(20 – 18 + 6 = 8)개 입니다.
빈 병 8개 중 6개를 마트에 가져가서, 2병의 콜라를 받습니다. 이때 상빈이가 가지고 있는 콜라 병의 수는 4(8 – 6 + 2 = 4)개 입니다.
빈 병 4 개중 3개를 마트에 가져가서, 1병의 콜라를 받습니다. 이때 상빈이가 가지고 있는 콜라 병의 수는 2(4 – 3 + 1 = 2)개 입니다.
3번의 교환 동안 상빈이는 9(6 + 2 + 1 = 9)병의 콜라를 받았습니다.
*/


// 빈병 a개를 주면 b병을 주는 마트가 있을 때 빈병 n개를 주면 몇개를 return 하는가?
let answer = 0;
let n      = 20;
let a      = 3;
let b      = 1;

while(n>a){ // 내가 가진 빈병이 마트에서 원하는 조건보다 클때 까지 반복
    let remain = n % a; // 20병중에 18병은 교환하고 2병은 남아있다.
    n = Math.floor(n/a) * b; // 1.5병이라는 콜라는 없다 -> Math.floor, 빈병 당 주는 마트의 주는 수를 곱한다. n = 6병이된다
    
    answer += n; // 새로 받은 콜라의 개수 누적 더하기
    n += remain; // 기존에 바꾸고 남은 콜라를 더해서 다시 교환을 시작한다.
}




// 다시 풀기


/*
while(n>a){ // 내가 가지고 있는 콜라는 마트에서 바꿔주는 기준보다 커야함
    let remain = n % a; // 일단 교환하고 남은 콜라(빈병 아님)
    n = Math.floor(n/a) * b // 콜라는 소수개수가 존재하지 않음 -> floor, 마트에서 주는 a당 b의 개수 -> 곱해주기
    answer += n; // 교환에서 새로 얻은 콜라의 수
    n += remain // 기존에 남아있던 콜라를 더해 다시 교환을 시작한다. 
}
*/
